#### Imports

In [4]:
import pandas as pd
import numpy as np

import pymysql
import sqlalchemy as alch
import os
from getpass import getpass

#### SQL Connection

In [7]:
password = getpass()
dbName = "linkedin"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

#### Import csv to SQL

In [9]:
linkedin_sql = pd.read_csv('../data/linkedin_salaries_sql.csv')
linkedin_sql.to_sql("linkedin", if_exists="append", con=engine, index=False)

491

#### Queries

    Relación de nivel de experiencia con remote_ratio.

In [20]:
query = '''
    select experience_level, count(remote_ratio) count_remote from linkedin
    where remote_ratio = "En remoto" and experience_level is not null
    group by experience_level
    order by count_remote desc;
'''
res = pd.read_sql_query(query, engine)
res

          experience_level  count_remote
0               Intermedio           113
1          Sin experiencia            46
2  Algo de responsabilidad            35
3                Prácticas             3
4                 Director             1

In [19]:
query = '''
    select experience_level, count(remote_ratio) count_hibrid from linkedin
    where remote_ratio = "Híbrido" and experience_level is not null
    group by experience_level
    order by count_hibrid desc;
'''
res = pd.read_sql_query(query, engine)
res

          experience_level  count_hibrid
0               Intermedio            88
1          Sin experiencia            30
2                Prácticas            22
3                 Director            13
4  Algo de responsabilidad            10

In [32]:
query = '''
    select experience_level, count(remote_ratio) count_onsite from linkedin
    where remote_ratio = "Presencial" and experience_level is not null
    group by experience_level
    order by count_onsite desc;
'''
res = pd.read_sql_query(query, engine)
res

          experience_level  count_onsite
0          Sin experiencia            51
1               Intermedio            40
2                Prácticas            21
3  Algo de responsabilidad             9
4                 Director             2
5                Ejecutivo             2

    Average salary by level of experience and type of employment.

In [21]:
query = '''
    select employment_type, experience_level, round(avg(salary), 2) as avg_salary
    from linkedin
    where experience_level is not null
    group by employment_type, experience_level
    order by employment_type, experience_level;
'''
res = pd.read_sql_query(query, engine)
res

     employment_type         experience_level  avg_salary
0  Contrato por obra  Algo de responsabilidad   161965.71
1  Contrato por obra               Intermedio   173107.93
2  Contrato por obra          Sin experiencia   109611.25
3   Jornada completa  Algo de responsabilidad   118282.98
4   Jornada completa                 Director   394218.75
5   Jornada completa                Ejecutivo   500000.00
6   Jornada completa               Intermedio   223371.63
7   Jornada completa                Prácticas    79548.00
8   Jornada completa          Sin experiencia   231312.48
9          Prácticas                Prácticas    89676.36

The same query done through pandas in order to see it quite more clean.

In [31]:
linkedin_sql.groupby(['employment_type', 'experience_level']).aggregate({'salary': ['mean']})

                                                  salary
                                                    mean
employment_type   experience_level
Contrato por obra Algo de responsabilidad  161965.714286
                  Intermedio               173107.932203
                  Sin experiencia          109611.250000
Jornada completa  Algo de responsabilidad  118282.978723
                  Director                 394218.750000
                  Ejecutivo                500000.000000
                  Intermedio               223371.631868
                  Prácticas                 79548.000000
                  Sin experiencia          231312.484211
Prácticas         Prácticas                 89676.363636

    Number of companies offering each job title with the minimun, average and maximum salary associated with each one.

In [33]:
query = '''
    select job_title, count(company_name) as num_companies, 
        round(min(salary), 2) as min_salary,
        round(avg(salary), 2) as avg_salary,
        round(max(salary), 2) as max_salary
    from linkedin
    group by job_title
    order by num_companies desc;
'''
res = pd.read_sql_query(query, engine)
res

,job_title,num_companies,min_salary,avg_salary,max_salary
0,Data Analyst,124,34560.0,154570.25,410000.0
1,Data Engineer,119,34560.0,184778.53,750000.0
2,Data Scientist,111,38400.0,187528.59,750000.0
3,Machine Learning Engineer,109,57600.0,247263.85,750000.0
4,Deep Learning Engineer,11,59700.0,262530.64,500000.0
5,AI Engineer,6,48000.0,134504.17,279125.0
6,Research Engineer,4,230000.0,248625.00,269500.0
7,BI Analyst,3,139500.0,236500.00,320000.0
8,Business Analyst,2,127500.0,138750.00,150000.0
9,BI Engineer,2,110000.0,110000.00,110000.0

    Relationship between job_title, company_size and its average salary.

In [34]:
query = '''
    select job_title, company_size, round(avg(salary), 2) as avg_salary
    from linkedin
    where company_size is not null
    group by job_title, company_size
    order by job_title;
'''
res = pd.read_sql_query(query, engine)
res

                    job_title company_size  avg_salary
0                 AI Engineer            L   116375.00
1                 AI Engineer            M   170762.50
2                  BI Analyst            L   194750.00
3                  BI Analyst            M   320000.00
4                 BI Engineer            L   110000.00
5            Business Analyst            L   150000.00
6            Business Analyst            M   127500.00
7                Data Analyst            L   147379.18
8                Data Analyst            M   169264.20
9                Data Analyst            S   200479.33
10              Data Engineer            L   163172.04
11              Data Engineer            M   206756.23
12              Data Engineer            S   299500.00
13             Data Scientist            L   186284.81
14             Data Scientist            M   187958.74
15             Data Scientist            S   187500.00
16     Deep Learning Engineer            L   288050.00
17     Deep Learning Engineer            M   205939.50
18     Deep Learning Engineer            S   500000.00
19  Machine Learning Engineer            L   256756.26
20  Machine Learning Engineer            M   232485.08
21  Machine Learning Engineer            S   257103.57
22          Research Engineer            L   230000.00
23          Research Engineer            M   269500.00
24          Research Engineer            S   265000.00